# SubEntityReadAccessGranted Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..SubEntityReadAccessGranted Method
Field Class See Also
---
Checks whether there is read access to subentities storable in this field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool SubEntityReadAccessGranted()
```

Visual Basic
---
```text
Public Function SubEntityReadAccessGranted As Boolean
```

Visual C++
---
```text
public:
bool SubEntityReadAccessGranted()
```

# ### Return Value
True if subentities are readable.
# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace